app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') ORDER BY release_date ASC
---
  def index
    forget = params.nil? ? false : params[:forget] == "true"
    session.clear if forget

    # make sure the data coming in is in right format or nil if not present
    session_ratings = (session[:rpsession].nil? || session[:rpsession][:ratings].nil?) ? nil : session[:rpsession][:ratings]
    session_sort = (session[:rpsession].nil? || session[:rpsession][:sort].nil?) ? nil : session[:rpsession][:sort]
    param_ratings = params.nil? ? nil : Movie.selected_ratings(params[:ratings])